dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/CANFD0_1.0.xml
        <register id="CANFD0_MCAN_ILE" width="32" offset="0x5C" description="MCAN Interrupt Line Enable">
            <bitfield id="EINT0" description="Enable Interrupt Line 0
  0  Interrupt Line 0 is disabled
  1  Interrupt Line 0 is enabled" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="EINT1" description="Enable Interrupt Line 1
  0  Interrupt Line 1 is disabled
  1  Interrupt Line 1 is enabled" begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_GFC" width="32" offset="0x80" description="MCAN Global Filter Configuration">
            <bitfield id="RRFE" description="Reject Remote Frames Extended
  0  Filter remote frames with 29-bit extended IDs
  1  Reject all remote frames with 29-bit extended IDs
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RRFS" description="Reject Remote Frames Standard
  0  Filter remote frames with 11-bit standard IDs
  1  Reject all remote frames with 11-bit standard IDs
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ANFE" description="Accept Non-matching Frames Extended. Defines how received messages with 29-bit IDs that do not match any element of the filter list are treated.
  00  Accept in Rx FIFO 0
  01  Accept in Rx FIFO 1
  10  Reject
  11  Reject
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="3" end="2" width="2" rwaccess="R/W">
            </bitfield>
            <bitfield id="ANFS" description="Accept Non-matching Frames Standard. Defines how received messages with 11-bit IDs that do not match any element of the filter list are treated.
  00  Accept in Rx FIFO 0
  01  Accept in Rx FIFO 1
  10  Reject
  11  Reject
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="5" end="4" width="2" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_SIDFC" width="32" offset="0x84" description="MCAN Standard ID Filter Configuration">
            <bitfield id="FLSSA" description="Filter List Standard Start Address. Start address of standard Message ID filter list (32-bit word address)." begin="15" end="2" width="14" rwaccess="R/W">
            </bitfield>
            <bitfield id="LSS" description="List Size Standard
  0        No standard Message ID filter
  1-128  Number of standard Message ID filter elements
  &gt;128   Values greater than 128 are interpreted as 128" begin="23" end="16" width="8" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_XIDFC" width="32" offset="0x88" description="MCAN Extended ID Filter Configuration">
            <bitfield id="FLESA" description="List Size Extended
  0     No extended Message ID filter
  1-64 Number of extended Message ID filter elements
  &gt;64  Values greater than 64 are interpreted as 64
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="15" end="2" width="14" rwaccess="R/W">
            </bitfield>
            <bitfield id="LSE" description="Filter List Extended Start Address. Start address of extended Message ID filter list (32-bit word address).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="22" end="16" width="7" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_XIDAM" width="32" offset="0x90" description="MCAN Extended ID and Mask">
            <bitfield id="EIDM" description="Extended ID Mask. For acceptance filtering of extended frames the Extended ID AND Mask is ANDed with the Message ID of a received frame. Intended for masking of 29-bit IDs in SAE J1939. With the reset value of all bits set to one the mask is not active.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="28" end="0" width="29" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_HPMS" width="32" offset="0x94" description="MCAN High Priority Message Status">
            <bitfield id="BIDX" description="Buffer Index. Index of Rx FIFO element to which the message was stored. Only valid when MSI(1) = '1'." begin="5" end="0" width="6" rwaccess="R">
            </bitfield>
            <bitfield id="MSI" description="Message Storage Indicator
  00  No FIFO selected
  01  FIFO message lost
  10  Message stored in FIFO 0
  11  Message stored in FIFO 1" begin="7" end="6" width="2" rwaccess="R">
            </bitfield>
            <bitfield id="FIDX" description="Filter Index. Index of matching filter element. Range is 0 to SIDFC.LSS - 1 resp. XIDFC.LSE - 1." begin="14" end="8" width="7" rwaccess="R">
            </bitfield>
            <bitfield id="FLST" description="Filter List. Indicates the filter list of the matching filter element.
  0  Standard Filter List
  1  Extended Filter List" begin="15" end="15" width="1" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_NDAT1" width="32" offset="0x98" description="MCAN New Data 1">
            <bitfield id="ND0" description="New Data RX Buffer 0
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND1" description="New Data RX Buffer 1
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND2" description="New Data RX Buffer 2
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND3" description="New Data RX Buffer 3
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND4" description="New Data RX Buffer 4
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND5" description="New Data RX Buffer 5
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND6" description="New Data RX Buffer 6
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND7" description="New Data RX Buffer 7
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND8" description="New Data RX Buffer 8
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND9" description="New Data RX Buffer 9
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND10" description="New Data RX Buffer 10
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND11" description="New Data RX Buffer 11
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND12" description="New Data RX Buffer 12
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND13" description="New Data RX Buffer 13
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND14" description="New Data RX Buffer 14
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND15" description="New Data RX Buffer 15
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND16" description="New Data RX Buffer 16
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND17" description="New Data RX Buffer 17
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND18" description="New Data RX Buffer 18
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND19" description="New Data RX Buffer 19
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND20" description="New Data RX Buffer 20
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="20" end="20" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND21" description="New Data RX Buffer 21
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND22" description="New Data RX Buffer 22
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND23" description="New Data RX Buffer 23
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND24" description="New Data RX Buffer 24
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND25" description="New Data RX Buffer 25
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND26" description="New Data RX Buffer 26
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND27" description="New Data RX Buffer 27
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND28" description="New Data RX Buffer 28
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND29" description="New Data RX Buffer 29
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND30" description="New Data RX Buffer 30
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="30" end="30" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND31" description="New Data RX Buffer 31
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="31" end="31" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_NDAT2" width="32" offset="0x9C" description="MCAN New Data 2">
            <bitfield id="ND32" description="New Data RX Buffer 32
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND33" description="New Data RX Buffer 33
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND34" description="New Data RX Buffer 34
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND35" description="New Data RX Buffer 35
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND36" description="New Data RX Buffer 36
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND37" description="New Data RX Buffer 37
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND38" description="New Data RX Buffer 38
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND39" description="New Data RX Buffer 39
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND40" description="New Data RX Buffer 40
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND41" description="New Data RX Buffer 41
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND42" description="New Data RX Buffer 42
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND43" description="New Data RX Buffer 43
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND44" description="New Data RX Buffer 44
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND45" description="New Data RX Buffer 45
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND46" description="New Data RX Buffer 46
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND47" description="New Data RX Buffer 47
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND48" description="New Data RX Buffer 48
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND49" description="New Data RX Buffer 49
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND50" description="New Data RX Buffer 50
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND51" description="New Data RX Buffer 51
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND52" description="New Data RX Buffer 52
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="20" end="20" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND53" description="New Data RX Buffer 53
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND54" description="New Data RX Buffer 54
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND55" description="New Data RX Buffer 55
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND56" description="New Data RX Buffer 56
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND57" description="New Data RX Buffer 57
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND58" description="New Data RX Buffer 58
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND59" description="New Data RX Buffer 59
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND60" description="New Data RX Buffer 60
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND61" description="New Data RX Buffer 61
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND62" description="New Data RX Buffer 62
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="30" end="30" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ND63" description="New Data RX Buffer 63
  0  Rx Buffer not updated
  1  Rx Buffer updated from new message" begin="31" end="31" width="1" rwaccess="R/W">
            </bitfield>
        </register>
