dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/CANFD0_1.0.xml
                </group>
            <group id="CANFD0_MCAN_ECC_REGS" name="CANFD0_MCAN_ECC_REGS" instances="1" offset="0x200" instaddr="0x210" description="">
                <register id="CANFD0_MCANERR_REV" width="32" offset="0x0" description="MCAN Error Aggregator Revision Register">
                    <bitfield id="REVMIN" description="Minor Revision of the Error Aggregator" begin="5" end="0" width="6" rwaccess="R">
                    </bitfield>
                    <bitfield id="REVMAJ" description="Major Revision of the Error Aggregator" begin="10" end="8" width="3" rwaccess="R">
                    </bitfield>
                    <bitfield id="MODULE_ID" description="Module Identification Number" begin="27" end="16" width="12" rwaccess="R">
                    </bitfield>
                    <bitfield id="SCHEME" description="PID Register Scheme" begin="31" end="30" width="2" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_VECTOR" width="32" offset="0x8" description="MCAN ECC Vector Register">
                    <bitfield id="ECC_VECTOR" description="ECC RAM ID. Each error detection and correction (EDC) controller has a bank of error registers (offsets 0x10 - 0x3B) associated with it. These registers are accessed via an internal serial bus (SVBUS). To access them through the ECC aggregator the controller ID desired must be written to the ECC_VECTOR field, together with the RD_SVBUS trigger and RD_SVBUS_ADDRESS bit field. This initiates the serial read which consummates by setting the RD_SVBUS_DONE bit. At this point the addressed register may be read by a normal CPU read of the appropriate offset address.
  0x000  Message RAM ECC controller is selected
  Others  Reserved (do not use)
 
Subsequent writes through the SVBUS (offsets 0x10 - 0x3B) have a delayed completion. To avoid conflicts, perform a read back of a register within this range after writing." begin="10" end="0" width="11" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="RD_SVBUS" description="Read Trigger" begin="15" end="15" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="RD_SVBUS_ADDRESS" description="Read Address Offset" begin="23" end="16" width="8" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="RD_SVBUS_DONE" description="Read Completion Flag" begin="24" end="24" width="1" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_STAT" width="32" offset="0xC" description="MCAN Error Misc Status">
                    <bitfield id="NUM_RAMS" description="Number of RAMs. Number of ECC RAMs serviced by the aggregator." begin="10" end="0" width="11" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_WRAP_REV" width="32" offset="0x10" description="MCAN ECC Wrapper Revision Register">
                    <bitfield id="REVMIN" description="Minor Revision of the Error Aggregator" begin="5" end="0" width="6" rwaccess="R">
                    </bitfield>
                    <bitfield id="REVMAJ" description="Major Revision of the Error Aggregator" begin="10" end="8" width="3" rwaccess="R">
                    </bitfield>
                    <bitfield id="MODULE_ID" description="Module Identification Number" begin="27" end="16" width="12" rwaccess="R">
                    </bitfield>
                    <bitfield id="SCHEME" description="PID Register Scheme" begin="31" end="30" width="2" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_CTRL" width="32" offset="0x14" description="MCAN ECC Control">
                    <bitfield id="ECC_ENABLE" description="Enable ECC Generation" begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_CHECK" description="Enable ECC Check. ECC is completely bypassed if both ECC_ENABLE and ECC_CHECK are '0'." begin="1" end="1" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ENABLE_RMW" description="Enable read-modify-write on partial word writes" begin="2" end="2" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="FORCE_SEC" description="Force single-bit error. Cleared on a writeback or the cycle following the error if ERROR_ONCE is asserted. For write through mode, this applies to writes as well as reads. MCANERR_ERR_CTRL1 and MCANERR_ERR_CTRL2 should be configured prior to setting this bit." begin="3" end="3" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="FORCE_DED" description="Force double-bit error. Cleared the cycle following the error if ERROR_ONCE is asserted. For write through mode, this applies to writes as well as reads. MCANERR_ERR_CTRL1 and MCANERR_ERR_CTRL2 should be configured prior to setting this bit." begin="4" end="4" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="FORCE_N_ROW" description="Enable single/double-bit error on the next RAM read, regardless of the MCANERR_ERR_CTRL1.ECC_ROW setting. For write through mode, this applies to writes as well as reads." begin="5" end="5" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ERROR_ONCE" description="If this bit is set, the FORCE_SEC/FORCE_DED will inject an error to the specified row only once. The FORCE_SEC bit will be cleared once a writeback happens. If writeback is not enabled, this error will be cleared the cycle following the read when the data is corrected. For double-bit errors, the FORCE_DED bit will be cleared the cycle following the double-bit error. Any subsequent reads will not force an error." begin="6" end="6" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CHECK_SVBUS_TIMEOUT" description="Enables Serial VBUS timeout mechanism" begin="8" end="8" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_ERR_CTRL1" width="32" offset="0x18" description="MCAN ECC Error Control 1 Register">
                </register>
                <register id="CANFD0_MCANERR_ERR_CTRL2" width="32" offset="0x1C" description="MCAN ECC Error Control 2 Register">
                    <bitfield id="ECC_BIT1" description="Column/Data bit that needs to be flipped when FORCE_SEC or FORCE_DED is set" begin="15" end="0" width="16" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_BIT2" description="Second column/data bit that needs to be flipped when FORCE_DED is set" begin="31" end="16" width="16" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_ERR_STAT1" width="32" offset="0x20" description="MCAN ECC Error Status 1 Register">
                    <bitfield id="ECC_SEC" description="Single Bit Error Corrected Status. A 2-bit saturating counter of the number of SEC errors that have occurred since last cleared.
 
  0  No single-bit error detected
  1  One single-bit error was detected and corrected
  2  Two single-bit errors were detected and corrected
  3  Three single-bit errors were detected and corrected
 
A write of a non-zero value to this bit field increments it by the value provided." begin="1" end="0" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_DED" description="Double Bit Error Detected Status. A 2-bit saturating counter of the number of DED errors that have occurred since last cleared.
 
  0  No double-bit error detected
  1  One double-bit error was detected
  2  Two double-bit errors were detected
  3  Three double-bit errors were detected
 
A write of a non-zero value to this bit field increments it by the value provided." begin="3" end="2" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_OTHER" description="SEC While Writeback Error Status
  0  No SEC error while writeback pending
  1  Indicates that successive single-bit errors have occurred while a writeback is still pending" begin="4" end="4" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CTRL_REG_ERROR" description="Control Register Error. A bit field in the control register is in an ambiguous state. This means that the redundancy registers have detected a state where not all values are the same and has defaulted to the reset state. S/W needs to re-write these registers to a known state. A write of 1 will set this interrupt flag." begin="7" end="7" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_ECC_SEC" description="Clear ECC_SEC. A write of a non-zero value to this bit field decrements the ECC_SEC bit field by the value provided." begin="9" end="8" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_ECC_DED" description="Clear ECC_DED. A write of a non-zero value to this bit field decrements the ECC_DED bit field by the value provided." begin="11" end="10" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_ECC_OTHER" description="Writing a '1' clears the ECC_OTHER bit." begin="12" end="12" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_CTRL_REG_ERROR" description="Writing a '1' clears the CTRL_REG_ERROR bit" begin="15" end="15" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ECC_BIT1" description="ECC Error Bit Position. Indicates the bit position in the RAM data that is in error on an SEC error. Only valid on an SEC error.
  0  Bit 0 is in error
  1  Bit 1 is in error
  2  Bit 2 is in error
  3  Bit 3 is in error
  ...
  31 Bit 31 is in error
  &gt;32 Invalid" begin="31" end="16" width="16" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_ERR_STAT2" width="32" offset="0x24" description="MCAN ECC Error Status 2 Register">
                </register>
                <register id="CANFD0_MCANERR_ERR_STAT3" width="32" offset="0x28" description="MCAN ECC Error Status 3 Register">
                    <bitfield id="WB_PEND" description="Delayed Write Back Pending Status
  0  No write back pending
  1  An ECC data correction write back is pending" begin="0" end="0" width="1" rwaccess="R">
                    </bitfield>
                    <bitfield id="SVBUS_TIMEOUT" description="Serial VBUS Timeout Flag. Write 1 to set." begin="1" end="1" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="CLR_SVBUS_TIMEOUT" description="Write 1 to clear the Serial VBUS Timeout Flag" begin="9" end="9" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_SEC_EOI" width="32" offset="0x3C" description="MCAN Single Error Corrected End of Interrupt Register">
                    <bitfield id="EOI_WR" description="Write to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host.
 
