dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/CANFD0_1.0.xml
A write of a non-zero value to this bit field decrements it by the value provided." begin="1" end="0" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="SVBUS_TIMEOUT" description="Aggregator Serial VBUS Timeout Error Status
 
2-bit saturating counter of the number of SVBUS timeout errors that have occurred since last cleared.
  0  No timeout errors have occurred
  1  One timeout error has occurred
  2  Two timeout errors have occurred
  3  Three timeout errors have occurred
 
A write of a non-zero value to this bit field decrements it by the value provided." begin="3" end="2" width="2" rwaccess="R/W">
                    </bitfield>
                </register>
                </group>
            </group>
        <group id="CANFD0_MSP" name="CANFD0_MSP" instances="1" offset="0x600" instaddr="0x400" description="">
            <group id="CANFD0_CPU_INT" name="CANFD0_CPU_INT" instances="1" offset="0x20" instaddr="0x30" description="">
                <register id="CANFD0_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
                    <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                        <bitenum id="NO_INTR" value="0x0" description="No interrupt pending."/>
                        <bitenum id="INTL0" value="0x1" description="MCAN Interrupt Line 0 interrupt pending."/>
                        <bitenum id="INTL1" value="0x2" description="MCAN Interrupt Line 1 interrupt pending."/>
                        <bitenum id="SEC" value="0x3" description="Message RAM SEC (Single Error Correction) interrupt pending."/>
                        <bitenum id="DED" value="0x4" description="Message RAM DED (Double Error Detection)  interrupt pending."/>
                        <bitenum id="EXT_TS_CNTR_OVFL" value="0x5" description="External Timestamp Counter Overflow interrupt pending."/>
                        <bitenum id="WAKEUP" value="0x6" description="Clock Stop Wake Up interrupt pending."/>
                    </bitfield>
                </register>
                <register id="CANFD0_IMASK" width="32" offset="0x8" description="Interrupt mask">
                    <bitfield id="INTL0" description="MCAN Interrupt Line 0 mask." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="INTL1" description="MCAN Interrupt Line 1 mask." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="SEC" description="Message RAM SEC interrupt mask." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="DED" description="Massage RAM DED interrupt mask." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow interrupt mask." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Clock Stop Wake Up interrupt mask." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                        <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
                    </bitfield>
                </register>
                <register id="CANFD0_RIS" width="32" offset="0x10" description="Raw interrupt status">
                    <bitfield id="INTL0" description="MCAN Interrupt Line 0." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="INTL1" description="MCAN Interrupt Line 1." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="SEC" description="Message RAM SEC interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="DED" description="Message RAM DED interrupt." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Clock Stop Wake Up interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                </register>
                <register id="CANFD0_MIS" width="32" offset="0x18" description="Masked interrupt status">
                    <bitfield id="INTL0" description="Masked MCAN Interrupt Line 0." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="INTL1" description="Masked MCAN Interrupt Line 1." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="SEC" description="Masked Message RAM SEC interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="DED" description="Masked Message RAM DED interrupt." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="Masked External Timestamp Counter Overflow interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Masked Clock Stop Wake Up interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                </register>
                <register id="CANFD0_ISET" width="32" offset="0x20" description="Interrupt set">
                    <bitfield id="INTL0" description="Set MCAN Interrupt Line 0." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="INTL1" description="Set MCAN Interrupt Line 1." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="SEC" description="Set Message RAM SEC interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="DED" description="Set Message RAM DED interrupt." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="Set External Timestamp Counter Overflow interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Set Clock Stop Wake Up interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                </register>
                <register id="CANFD0_ICLR" width="32" offset="0x28" description="Interrupt clear">
                    <bitfield id="INTL0" description="Clear MCAN Interrupt Line 0." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="INTL1" description="Clear MCAN Interrupt Line 1." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="SEC" description="Clear Message RAM SEC interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="DED" description="Clear Message RAM DED interrupt." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="Clear External Timestamp Counter Overflow interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Clear Clock Stop Wake Up interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                </register>
