dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/CANFD0_1.0.xml
                </group>
            <register id="CANFD0_EVT_MODE" width="32" offset="0xE0" description="Event Mode">
                <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.CPU_INT]" begin="1" end="0" width="2" rwaccess="R">
                    <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
                    <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
                    <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
                </bitfield>
            </register>
            <register id="CANFD0_DESC" width="32" offset="0xFC" description="Module Description">
                <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
                    <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                    <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
                </bitfield>
                <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
                    <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                    <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
                </bitfield>
                <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
                    <bitenum id="VERSION_0" value="0x0" description="MCAN module with CAN-FD mode enabled  &lt;&lt;Internal Note: This is an in-IP paper spin variant. How does this map to the SYS_MCAN_ENABLE_FD choice value?&gt;&gt;"/>
                    <bitenum id="VERSION_1" value="0x1" description="MCAN module with CAN-FD mode disabled  &lt;&lt;Internal Note: This is an in-IP paper spin variant. How does this map to the SYS_MCAN_ENABLE_FD choice value?&gt;&gt;"/>
                </bitfield>
                <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
                    <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                    <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
                </bitfield>
            </register>
            <register id="CANFD0_MCANSS_CLKEN" width="32" offset="0x100" description="MCAN module clock enable">
                <bitfield id="CLK_REQEN" description="MCAN functional and MCAN/MCANSS MMR clock request enable bit" begin="0" end="0" width="1" rwaccess="R/W">
                    <bitenum id="CLR" value="0x0" description="MCAN module functional clock and Vbusp is not requested.  These clocks are gated to the MCAN module."/>
                    <bitenum id="SET" value="0x1" description="Setting this bit requests MCAN module functional clock and Vbusp. These clocks are not gated to MCAN module."/>
                </bitfield>
            </register>
            <register id="CANFD0_MCANSS_CLKDIV" width="32" offset="0x104" description="Clock divider">
                <bitfield id="RATIO" description="Clock divide ratio specification. Enables configuring clock divide settings for the MCAN functional clock input to the MCAN-SS." begin="1" end="0" width="2" rwaccess="R/W">
                    <bitenum id="DIV_BY_1_" value="0x0" description="Divides input clock by 1"/>
                    <bitenum id="DIV_BY_2_" value="0x1" description="Divides input clock by 2"/>
                    <bitenum id="DIV_BY_4_" value="0x2" description="Divides input clock by 4"/>
                    <bitenum id="DIV_BY_1_1" value="0x3" description="Divides input clock by 1"/>
                </bitfield>
            </register>
            <register id="CANFD0_MCANSS_CLKCTL" width="32" offset="0x108" description="MCAN-SS clock stop control register">
                <bitfield id="STOPREQ" description="This bit is used to enable/disable MCAN clock (both host clock and functional clock) gating request.

Note: This bit can be reset by HW by Clock-Stop Wake-up via CAN RX Activity. See spec for more details." begin="0" end="0" width="1" rwaccess="R/W">
                    <bitenum id="DISABLE" value="0x0" description="Disable MCAN-SS clock stop request"/>
                    <bitenum id="ENABLE" value="0x1" description="Enable MCAN-SS clock stop request"/>
                </bitfield>
                <bitfield id="WAKEUP_INT_EN" description="This bit contols enabling or disabling the MCAN IP clock stop wakeup interrupt (when MCANSS_CTRL.WAKEUPREQEN wakeup request is enabled to wakeup MCAN IP upon CAN RXD activity)" begin="4" end="4" width="1" rwaccess="R/W">
                    <bitenum id="DISABLE" value="0x0" description="Disable MCAN IP clock stop wakeup interrupt"/>
                    <bitenum id="ENABLE" value="0x1" description="Enable MCAN IP clock stop wakeup interrupt"/>
                </bitfield>
                <bitfield id="WKUP_GLTFLT_EN" description="Setting this bit enables the glitch filter on MCAN RXD input, which wakes up the MCAN controller to exit clock gating." begin="8" end="8" width="1" rwaccess="R/W">
                    <bitenum id="DISABLE" value="0x0" description="Disable glitch filter enable on RXD input when MCAN is in clock stop mode (waiting for event on RXD input for clock stop wakeup)."/>
                    <bitenum id="ENABLE" value="0x1" description="Enable glitch filter enable on RXD input when MCAN is in clock stop mode (waiting for event on RXD input for clock stop wakeup)."/>
                </bitfield>
            </register>
            <register id="CANFD0_MCANSS_CLKSTS" width="32" offset="0x10C" description="MCANSS clock stop status register">
                <bitfield id="CLKSTOP_ACKSTS" description="Clock stop acknowledge status from MCAN IP" begin="0" end="0" width="1" rwaccess="R">
                    <bitenum id="RESET" value="0x0" description="No clock stop acknowledged."/>
                    <bitenum id="SET" value="0x1" description="Clock stop has been acknowledged by MCAN IP; MCAN-SS may be clock gated by stopping both the CAN host and functional clocks."/>
                </bitfield>
                <bitfield id="STOPREQ_HW_OVR" description="MCANSS clock stop HW override status bit. 

This bit indicates when the MCANSS_CLKCTL.STOPREQ bit has been cleared by HW when a clock-stop wake-up event via CAN RX activity is triggered." begin="4" end="4" width="1" rwaccess="R">
                    <bitenum id="RESET" value="0x0" description="MCANSS_CLKCTL.STOPREQ bit has not been cleared by HW."/>
                    <bitenum id="SET" value="0x1" description="MCANSS_CLKCTL.STOPREQ bit has been cleared by HW."/>
                </bitfield>
                <bitfield id="CCLKDONE" description="This bit indicates the status of MCAN contoller clock request from GPRCM." begin="8" end="8" width="1" rwaccess="R">
                    <bitenum id="RESET" value="0x0" description="MCAN controller clock is not available to the MCAN IP."/>
                    <bitenum id="SET" value="0x1" description="MCAN controller clock is enabled and available to the MCAN IP."/>
                </bitfield>
            </register>
            </group>
        </group>

</module>